VictorSLR/Teste/victor_doglas_lab2/src/tm4c1294ncpdt_pt2.h
//*****************************************************************************
//
// tm4c1294ncpdt.h - TM4C1294NCPDT Register Definitions
//
// Copyright (c) 2013-2014 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
//   Redistribution and use in source and binary forms, with or without
//   modification, are permitted provided that the following conditions
//   are met:
// 
//   Redistributions of source code must retain the above copyright
//   notice, this list of conditions and the following disclaimer.
// 
//   Redistributions in binary form must reproduce the above copyright
//   notice, this list of conditions and the following disclaimer in the
//   documentation and/or other materials provided with the  
//   distribution.
// 
//   Neither the name of Texas Instruments Incorporated nor the names of
//   its contributors may be used to endorse or promote products derived
//   from this software without specific prior written permission.
// 
// THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
// "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
// LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
// OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
// SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
// LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
// DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
// THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
// (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
// OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
// 
// This is part of revision 2.1.0.12573 of the Tiva Firmware Development Package.
//
//*****************************************************************************

#ifndef __TM4C1294NCPDT_H__
#define __TM4C1294NCPDT_H__
#define GPIO_PORTJN 			(0x1100) //bits 8 e 12
#define GPIO_PORTA        (0x1) 	//porta 0	
#define GPIO_PORTQ        (0x4000)//porta 14
#define GPIO_PORTP        (0x2000)//porta 13
#define GPIO_PORTM        (0x800)// porta 11
#define GPIO_PORTL      	(0x400)
#define GPIO_PORTK       	(0x200)
#define GPIO_PORTC 	    	(0x4)
#define GPIO_PORTF 	    	(0x20)
#define GPIO_PORTH 	    	(0x80)
#define GPIO_PORTE 	    	(0x10)
#define GPIO_PORTB        (0x2)

				// TODAS AS CONFIGURAÇÕES SÃO PARA O PORTJ
#define PORTJ_GPIOIM		(*((volatile uint32_t *)0x40060410))			
#define PORTJ_GPIOIS	 	(*((volatile uint32_t *)0x40060404))
#define PORTJ_GPIOIBE		(*((volatile uint32_t *)0x40060408))
#define PORTJ_GPIORIS		(*((volatile uint32_t *)0x40060414))
#define PORTJ_GPIOICR		(*((volatile uint32_t *)0x4006041C))
#define NVIC_EN0 				(*((volatile uint32_t *)0xE000E100))
#define NVIC_EN1 				(*((volatile uint32_t *)0xE000E104))		//ATIVAR PARA O PORTJ 51 OU 0x00080000
#define NVIC_EN2				(*((volatile uint32_t *)0xE000E108))		//ATIVAR PARA O PORTJ 51 OU 0x00080000
#define NVIC_EN3				(*((volatile uint32_t *)0xE000E108))		//ATIVAR PARA O PORTJ 51 OU 0x00080000

#define NVIC_DIS1				(*((volatile uint32_t *)0xE000E184))		//DESATIVAR PARA O PORTJ 51 OU 0x00080000
#define NVIC_DIS0				(*((volatile uint32_t *)0xE000E180))
#define NVIC_DIS2				(*((volatile uint32_t *)0xE000E188))
#define NVIC_DIS3				(*((volatile uint32_t *)0xE000E18C))

#define NVIC_PRI0				(*((volatile uint32_t *)0xE000E400))//0-3
#define NVIC_PRI1				(*((volatile uint32_t *)0xE000E404))//4-7
#define NVIC_PRI2				(*((volatile uint32_t *)0xE000E408))//8-11
#define NVIC_PRI3				(*((volatile uint32_t *)0xE000E40C))//12-15
#define NVIC_PRI4				(*((volatile uint32_t *)0xE000E410))//16-19
#define NVIC_PRI5				(*((volatile uint32_t *)0xE000E414))//20-23 
#define NVIC_PRI6				(*((volatile uint32_t *)0xE000E418))//24-27
#define NVIC_PRI7				(*((volatile uint32_t *)0xE000E41C))//28-31
#define NVIC_PRI8				(*((volatile uint32_t *)0xE000E420))//32-35
#define NVIC_PRI9				(*((volatile uint32_t *)0xE000E424))//36-39
#define NVIC_PRI10			(*((volatile uint32_t *)0xE000E428))//40-43
#define NVIC_PRI11			(*((volatile uint32_t *)0xE000E42C))//44-47
#define NVIC_PRI12			(*((volatile uint32_t *)0xE000E430))//48-51		
#define NVIC_PRI13			(*((volatile uint32_t *)0xE000E434))//52-55
#define NVIC_PRI14			(*((volatile uint32_t *)0xE000E438))//56-59		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI15			(*((volatile uint32_t *)0xE000E43C))//60-63
	
#define NVIC_PRI16			(*((volatile uint32_t *)0xE000E440))//64-67		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI17			(*((volatile uint32_t *)0xE000E444))//68-71
#define NVIC_PRI18			(*((volatile uint32_t *)0xE000E448))//72-75		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI19			(*((volatile uint32_t *)0xE000E44C))//76-79
#define NVIC_PRI20			(*((volatile uint32_t *)0xE000E450))//80-83		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI21			(*((volatile uint32_t *)0xE000E454))//84-87		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI22			(*((volatile uint32_t *)0xE000E458))//88-91
#define NVIC_PRI23			(*((volatile uint32_t *)0xE000E45C))//92-95		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI24			(*((volatile uint32_t *)0xE000E460))//96-99
#define NVIC_PRI25			(*((volatile uint32_t *)0xE000E464))//100-103		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI26			(*((volatile uint32_t *)0xE000E468))//104-107	// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF
#define NVIC_PRI27			(*((volatile uint32_t *)0xE000E46C))//108-111
#define NVIC_PRI28			(*((volatile uint32_t *)0xE000E470))//112-113		// FAZER ESCRITA AMIGAVEL NOS ULTIMOS BITS FAZER UM AND DE 0x0FFFFFFF


//#define BASEPRI 				(*((volatile uint32_t *)0x00000000))

//timer

#define RCGCTIMER						(*((volatile uint32_t *)0x400FE604))
#define PRTIMER							(*((volatile uint32_t *)0x400FEA04))
#define GPTMCTL_TIMER_0			(*((volatile uint32_t *)0x4003000C))
#define GPTMCTL_TIMER_1			(*((volatile uint32_t *)0x4003100C))
#define GPTMCTL_TIMER_2			(*((volatile uint32_t *)0x4003200C))
#define GPTMCTL_TIMER_3			(*((volatile uint32_t *)0x4003300C))
#define GPTMCTL_TIMER_4			(*((volatile uint32_t *)0x4003400C))
#define GPTMCTL_TIMER_5			(*((volatile uint32_t *)0x4003500C))
#define GPTMCTL_TIMER_6			(*((volatile uint32_t *)0x400E000C))
#define GPTMCTL_TIMER_7			(*((volatile uint32_t *)0x400E100C))
		
#define GPTMCFG_TIMER_0 		(*((volatile uint32_t *)0x40030000))
#define GPTMCFG_TIMER_1 		(*((volatile uint32_t *)0x40031000))
#define GPTMCFG_TIMER_2 		(*((volatile uint32_t *)0x40032000))
#define GPTMCFG_TIMER_3 		(*((volatile uint32_t *)0x40033000))
#define GPTMCFG_TIMER_4			(*((volatile uint32_t *)0x40034000))
#define GPTMCFG_TIMER_5			(*((volatile uint32_t *)0x40035000))
#define GPTMCFG_TIMER_6			(*((volatile uint32_t *)0x400E0000))
#define GPTMCFG_TIMER_7			(*((volatile uint32_t *)0x400E1000))

