VictorSLR/Teste/victor_doglas_lab2/src/tm4c1294ncpdt_pt2.h
#define GPTMTAMR_TIMER_0		(*((volatile uint32_t *)0x40030004))
#define GPTMTAMR_TIMER_1		(*((volatile uint32_t *)0x40031004))
#define GPTMTAMR_TIMER_2		(*((volatile uint32_t *)0x40032004))
#define GPTMTAMR_TIMER_3		(*((volatile uint32_t *)0x40033004))
#define GPTMTAMR_TIMER_4		(*((volatile uint32_t *)0x40034004))
#define GPTMTAMR_TIMER_5		(*((volatile uint32_t *)0x40035004))
#define GPTMTAMR_TIMER_6		(*((volatile uint32_t *)0x400E0004))
#define GPTMTAMR_TIMER_7		(*((volatile uint32_t *)0x400E1004))

#define GPTMTBMR_TIMER_0		(*((volatile uint32_t *)0x40030008))
#define GPTMTBMR_TIMER_1		(*((volatile uint32_t *)0x40031008))
#define GPTMTBMR_TIMER_2		(*((volatile uint32_t *)0x40032008))
#define GPTMTBMR_TIMER_3		(*((volatile uint32_t *)0x40033008))
#define GPTMTBMR_TIMER_4		(*((volatile uint32_t *)0x40034008))
#define GPTMTBMR_TIMER_5		(*((volatile uint32_t *)0x40035008))
#define GPTMTBMR_TIMER_6		(*((volatile uint32_t *)0x400E0008))
#define GPTMTBMR_TIMER_7		(*((volatile uint32_t *)0x400E1008))

#define GPTMTAILR_TIMER_0		(*((volatile uint32_t *)0x40030028))
#define GPTMTBILR_TIMER_0		(*((volatile uint32_t *)0x4003002C))
#define GPTMTAILR_TIMER_1		(*((volatile uint32_t *)0x40031028))
#define GPTMTBILR_TIMER_1		(*((volatile uint32_t *)0x4003102C))
#define GPTMTAILR_TIMER_2		(*((volatile uint32_t *)0x40032028))
#define GPTMTBILR_TIMER_2		(*((volatile uint32_t *)0x4003202C))
#define GPTMTAILR_TIMER_3		(*((volatile uint32_t *)0x40033028))
#define GPTMTBILR_TIMER_3		(*((volatile uint32_t *)0x4003302C))
#define GPTMTAILR_TIMER_4		(*((volatile uint32_t *)0x40034028))
#define GPTMTBILR_TIMER_4		(*((volatile uint32_t *)0x4003402C))
#define GPTMTAILR_TIMER_5		(*((volatile uint32_t *)0x40035028))
#define GPTMTBILR_TIMER_5		(*((volatile uint32_t *)0x4003502C))
#define GPTMTAILR_TIMER_6		(*((volatile uint32_t *)0x400E0028))
#define GPTMTBILR_TIMER_6		(*((volatile uint32_t *)0x400E002C))
#define GPTMTAILR_TIMER_7		(*((volatile uint32_t *)0x400E1028))
#define GPTMTBILR_TIMER_7		(*((volatile uint32_t *)0x400E102C))
	
#define GPTMTAPR_TIMER_0 		(*((volatile uint32_t *)0x40030038))
#define GPTMTBPR_TIMER_0 		(*((volatile uint32_t *)0x4003003C))
#define GPTMTAPR_TIMER_1 		(*((volatile uint32_t *)0x40031038))
#define GPTMTBPR_TIMER_1 		(*((volatile uint32_t *)0x4003103C))
#define GPTMTAPR_TIMER_2 		(*((volatile uint32_t *)0x40032038))
#define GPTMTBPR_TIMER_2 		(*((volatile uint32_t *)0x4003203C))
#define GPTMTAPR_TIMER_3 		(*((volatile uint32_t *)0x40033038))
#define GPTMTBPR_TIMER_3 		(*((volatile uint32_t *)0x4003303C))
#define GPTMTAPR_TIMER_4 		(*((volatile uint32_t *)0x40034038))
#define GPTMTBPR_TIMER_4 		(*((volatile uint32_t *)0x4003403C))
#define GPTMTAPR_TIMER_5 		(*((volatile uint32_t *)0x40035038))
#define GPTMTBPR_TIMER_5 		(*((volatile uint32_t *)0x4003503C))
#define GPTMTAPR_TIMER_6 		(*((volatile uint32_t *)0x400E0038))
#define GPTMTBPR_TIMER_6 		(*((volatile uint32_t *)0x400E003C))
#define GPTMTAPR_TIMER_7 		(*((volatile uint32_t *)0x400E1038))
#define GPTMTBPR_TIMER_7 		(*((volatile uint32_t *)0x400E103C))


#define GPTMICR_TIMER_0 		(*((volatile uint32_t *)0x40030024))
#define GPTMICR_TIMER_1 		(*((volatile uint32_t *)0x40031024))
#define GPTMICR_TIMER_2 		(*((volatile uint32_t *)0x40032024))
#define GPTMICR_TIMER_3 		(*((volatile uint32_t *)0x40033024))
#define	GPTMICR_TIMER_4			(*((volatile uint32_t *)0x40034024))
#define GPTMICR_TIMER_5			(*((volatile uint32_t *)0x40035024))
#define GPTMICR_TIMER_6			(*((volatile uint32_t *)0x400E0024))
#define GPTMICR_TIMER_7			(*((volatile uint32_t *)0x400E1024))


#define GPTMIMR_TIMER_0			(*((volatile uint32_t *)0x40030018))
#define GPTMIMR_TIMER_1			(*((volatile uint32_t *)0x40031018))
#define GPTMIMR_TIMER_2			(*((volatile uint32_t *)0x40032018))
#define GPTMIMR_TIMER_3			(*((volatile uint32_t *)0x40033018))
#define	GPTMIMR_TIMER_4			(*((volatile uint32_t *)0x40034018))
#define GPTMIMR_TIMER_5			(*((volatile uint32_t *)0x40035018))
#define GPTMIMR_TIMER_6			(*((volatile uint32_t *)0x400E0018))
#define GPTMIMR_TIMER_7			(*((volatile uint32_t *)0x400E1018))

// ANALÓGICA

#define RCGCADC							(*((volatile uint32_t *)0x400FE638))
#define PRADC								(*((volatile uint32_t *)0x400FEA38))
#define	ADCPC								(*((volatile uint32_t *)0x40038FC4)) //ADC0
#define	ADCSSPRI						(*((volatile uint32_t *)0x40038020))
#define	ADCACTSS						(*((volatile uint32_t *)0x40038000))
#define	ADCEMUX							(*((volatile uint32_t *)0x40038014))
#define	ADCSSMUX1 					(*((volatile uint32_t *)0x40038060))
#define	ADCSSMUX2						(*((volatile uint32_t *)0x40038080))
#define	ADCSSMUX3						(*((volatile uint32_t *)0x400380A0))
#define	ADCSSCTL1 					(*((volatile uint32_t *)0x40038064))
#define	ADCSSCTL2						(*((volatile uint32_t *)0x40038084))
#define	ADCSSCTL3						(*((volatile uint32_t *)0x400380A4))
#define	ADCPSSI							(*((volatile uint32_t *)0x40038028))
#define	ADCRIS							(*((volatile uint32_t *)0x40038004))
#define	ADCSSFIFO3					(*((volatile uint32_t *)0x400380A8))
#define	ADCISC							(*((volatile uint32_t *)0x4003800C))
/////////////////////////////////////////////////////////////////////	

#define FREQUENCIA 	 (((volatile uint32_t )0x00027100))				//clock para 1ms
#define FREQUENCIA_0 (((volatile uint32_t )(FREQUENCIA*0xA)))	//CLOCK PARA 10ms
#define FREQUENCIA_1 (((volatile uint32_t )((FREQUENCIA_0)+FREQUENCIA*0x2))) // clock para 12ms
#define FREQUENCIA_2 (((volatile uint32_t )((FREQUENCIA_0)+FREQUENCIA*0x4))) // clock para 14ms
#define FREQUENCIA_3 (((volatile uint32_t )((FREQUENCIA_0)+FREQUENCIA*0x6)))// clock para 16ms
#define FREQUENCIA_4 (((volatile uint32_t )((FREQUENCIA_0)+FREQUENCIA*0x8)))//// clock para 18ms
#define FREQUENCIA_5 (((volatile uint32_t )((FREQUENCIA_0)+FREQUENCIA*0xA)))// clock para 20ms
#define time_25ms		 (((volatile uint32_t )0x0003D090))
#define time_50ms		 (((volatile uint32_t )0x0007A120))
#define time_500ms	 (((volatile uint32_t )0x004C4B40))
	


//*****************************************************************************
//
// Interrupt assignments
//
//*****************************************************************************
#define INT_GPIOA               16          // GPIO Port A
#define INT_GPIOB               17          // GPIO Port B
#define INT_GPIOC               18          // GPIO Port C
#define INT_GPIOD               19          // GPIO Port D
#define INT_GPIOE               20          // GPIO Port E
#define INT_UART0               21          // UART0
#define INT_UART1               22          // UART1
#define INT_SSI0                23          // SSI0
#define INT_I2C0                24          // I2C0
#define INT_PWM0_FAULT          25          // PWM Fault
#define INT_PWM0_0              26          // PWM Generator 0
#define INT_PWM0_1              27          // PWM Generator 1
#define INT_PWM0_2              28          // PWM Generator 2
#define INT_QEI0                29          // QEI0
#define INT_ADC0SS0             30          // ADC0 Sequence 0
#define INT_ADC0SS1             31          // ADC0 Sequence 1
#define INT_ADC0SS2             32          // ADC0 Sequence 2
#define INT_ADC0SS3             33          // ADC0 Sequence 3
#define INT_WATCHDOG            34          // Watchdog Timers 0 and 1
#define INT_TIMER0A             35          // 16/32-Bit Timer 0A
#define INT_TIMER0B             36          // 16/32-Bit Timer 0B
#define INT_TIMER1A             37          // 16/32-Bit Timer 1A
#define INT_TIMER1B             38          // 16/32-Bit Timer 1B
#define INT_TIMER2A             39          // 16/32-Bit Timer 2A
#define INT_TIMER2B             40          // 16/32-Bit Timer 2B
#define INT_COMP0               41          // Analog Comparator 0
#define INT_COMP1               42          // Analog Comparator 1
#define INT_COMP2               43          // Analog Comparator 2
#define INT_SYSCTL              44          // System Control
#define INT_FLASH               45          // Flash Memory Control
#define INT_GPIOF               46          // GPIO Port F
#define INT_GPIOG               47          // GPIO Port G
#define INT_GPIOH               48          // GPIO Port H
#define INT_UART2               49          // UART2
#define INT_SSI1                50          // SSI1
#define INT_TIMER3A             51          // 16/32-Bit Timer 3A
#define INT_TIMER3B             52          // 16/32-Bit Timer 3B
#define INT_I2C1                53          // I2C1
#define INT_CAN0                54          // CAN 0
#define INT_CAN1                55          // CAN1
#define INT_EMAC0               56          // Ethernet MAC
#define INT_HIBERNATE           57          // HIB
#define INT_USB0                58          // USB MAC
#define INT_PWM0_3              59          // PWM Generator 3
#define INT_UDMA                60          // uDMA 0 Software
#define INT_UDMAERR             61          // uDMA 0 Error
#define INT_ADC1SS0             62          // ADC1 Sequence 0
#define INT_ADC1SS1             63          // ADC1 Sequence 1
#define INT_ADC1SS2             64          // ADC1 Sequence 2
#define INT_ADC1SS3             65          // ADC1 Sequence 3
#define INT_EPI0                66          // EPI 0
#define INT_GPIOJ               67          // GPIO Port J
#define INT_GPIOK               68          // GPIO Port K
#define INT_GPIOL               69          // GPIO Port L
#define INT_SSI2                70          // SSI 2
#define INT_SSI3                71          // SSI 3
#define INT_UART3               72          // UART 3
#define INT_UART4               73          // UART 4
#define INT_UART5               74          // UART 5
#define INT_UART6               75          // UART 6
#define INT_UART7               76          // UART 7
#define INT_I2C2                77          // I2C 2
#define INT_I2C3                78          // I2C 3
#define INT_TIMER4A             79          // Timer 4A
#define INT_TIMER4B             80          // Timer 4B
#define INT_TIMER5A             81          // Timer 5A
#define INT_TIMER5B             82          // Timer 5B
#define INT_SYSEXC              83          // Floating-Point Exception
                                            // (imprecise)
#define INT_I2C4                86          // I2C 4
#define INT_I2C5                87          // I2C 5
#define INT_GPIOM               88          // GPIO Port M
#define INT_GPION               89          // GPIO Port N
#define INT_TAMPER0             91          // Tamper
#define INT_GPIOP0              92          // GPIO Port P (Summary or P0)
#define INT_GPIOP1              93          // GPIO Port P1
#define INT_GPIOP2              94          // GPIO Port P2
#define INT_GPIOP3              95          // GPIO Port P3
#define INT_GPIOP4              96          // GPIO Port P4
#define INT_GPIOP5              97          // GPIO Port P5
#define INT_GPIOP6              98          // GPIO Port P6
#define INT_GPIOP7              99          // GPIO Port P7
#define INT_GPIOQ0              100         // GPIO Port Q (Summary or Q0)
#define INT_GPIOQ1              101         // GPIO Port Q1
#define INT_GPIOQ2              102         // GPIO Port Q2
#define INT_GPIOQ3              103         // GPIO Port Q3
#define INT_GPIOQ4              104         // GPIO Port Q4
#define INT_GPIOQ5              105         // GPIO Port Q5
#define INT_GPIOQ6              106         // GPIO Port Q6
#define INT_GPIOQ7              107         // GPIO Port Q7
#define INT_TIMER6A             114         // 16/32-Bit Timer 6A
#define INT_TIMER6B             115         // 16/32-Bit Timer 6B
#define INT_TIMER7A             116         // 16/32-Bit Timer 7A
#define INT_TIMER7B             117         // 16/32-Bit Timer 7B
#define INT_I2C6                118         // I2C 6
#define INT_I2C7                119         // I2C 7
#define INT_I2C8                125         // I2C 8
#define INT_I2C9                126         // I2C 9

//*****************************************************************************
//
// Watchdog Timer registers (WATCHDOG0)
//
//*****************************************************************************
#define WATCHDOG0_LOAD_R        (*((volatile uint32_t *)0x40000000))
#define WATCHDOG0_VALUE_R       (*((volatile uint32_t *)0x40000004))
#define WATCHDOG0_CTL_R         (*((volatile uint32_t *)0x40000008))
#define WATCHDOG0_ICR_R         (*((volatile uint32_t *)0x4000000C))
#define WATCHDOG0_RIS_R         (*((volatile uint32_t *)0x40000010))
#define WATCHDOG0_MIS_R         (*((volatile uint32_t *)0x40000014))
#define WATCHDOG0_TEST_R        (*((volatile uint32_t *)0x40000418))
#define WATCHDOG0_LOCK_R        (*((volatile uint32_t *)0x40000C00))

//*****************************************************************************
//
// Watchdog Timer registers (WATCHDOG1)
//
//*****************************************************************************
#define WATCHDOG1_LOAD_R        (*((volatile uint32_t *)0x40001000))
#define WATCHDOG1_VALUE_R       (*((volatile uint32_t *)0x40001004))
#define WATCHDOG1_CTL_R         (*((volatile uint32_t *)0x40001008))
#define WATCHDOG1_ICR_R         (*((volatile uint32_t *)0x4000100C))
#define WATCHDOG1_RIS_R         (*((volatile uint32_t *)0x40001010))
#define WATCHDOG1_MIS_R         (*((volatile uint32_t *)0x40001014))
#define WATCHDOG1_TEST_R        (*((volatile uint32_t *)0x40001418))
#define WATCHDOG1_LOCK_R        (*((volatile uint32_t *)0x40001C00))

//*****************************************************************************
//
// SSI registers (SSI0)
//
//*****************************************************************************
#define SSI0_CR0_R              (*((volatile uint32_t *)0x40008000))
#define SSI0_CR1_R              (*((volatile uint32_t *)0x40008004))
#define SSI0_DR_R               (*((volatile uint32_t *)0x40008008))
#define SSI0_SR_R               (*((volatile uint32_t *)0x4000800C))
#define SSI0_CPSR_R             (*((volatile uint32_t *)0x40008010))
#define SSI0_IM_R               (*((volatile uint32_t *)0x40008014))
#define SSI0_RIS_R              (*((volatile uint32_t *)0x40008018))
#define SSI0_MIS_R              (*((volatile uint32_t *)0x4000801C))
#define SSI0_ICR_R              (*((volatile uint32_t *)0x40008020))
#define SSI0_DMACTL_R           (*((volatile uint32_t *)0x40008024))
#define SSI0_PP_R               (*((volatile uint32_t *)0x40008FC0))
#define SSI0_CC_R               (*((volatile uint32_t *)0x40008FC8))

//*****************************************************************************
//
// SSI registers (SSI1)
//
//*****************************************************************************
#define SSI1_CR0_R              (*((volatile uint32_t *)0x40009000))
#define SSI1_CR1_R              (*((volatile uint32_t *)0x40009004))
#define SSI1_DR_R               (*((volatile uint32_t *)0x40009008))
#define SSI1_SR_R               (*((volatile uint32_t *)0x4000900C))
#define SSI1_CPSR_R             (*((volatile uint32_t *)0x40009010))
#define SSI1_IM_R               (*((volatile uint32_t *)0x40009014))
#define SSI1_RIS_R              (*((volatile uint32_t *)0x40009018))
#define SSI1_MIS_R              (*((volatile uint32_t *)0x4000901C))
#define SSI1_ICR_R              (*((volatile uint32_t *)0x40009020))
#define SSI1_DMACTL_R           (*((volatile uint32_t *)0x40009024))
#define SSI1_PP_R               (*((volatile uint32_t *)0x40009FC0))
#define SSI1_CC_R               (*((volatile uint32_t *)0x40009FC8))

//*****************************************************************************
//
// SSI registers (SSI2)
//
//*****************************************************************************
#define SSI2_CR0_R              (*((volatile uint32_t *)0x4000A000))
#define SSI2_CR1_R              (*((volatile uint32_t *)0x4000A004))
#define SSI2_DR_R               (*((volatile uint32_t *)0x4000A008))
#define SSI2_SR_R               (*((volatile uint32_t *)0x4000A00C))
#define SSI2_CPSR_R             (*((volatile uint32_t *)0x4000A010))
#define SSI2_IM_R               (*((volatile uint32_t *)0x4000A014))
#define SSI2_RIS_R              (*((volatile uint32_t *)0x4000A018))
#define SSI2_MIS_R              (*((volatile uint32_t *)0x4000A01C))
#define SSI2_ICR_R              (*((volatile uint32_t *)0x4000A020))
#define SSI2_DMACTL_R           (*((volatile uint32_t *)0x4000A024))
#define SSI2_PP_R               (*((volatile uint32_t *)0x4000AFC0))
#define SSI2_CC_R               (*((volatile uint32_t *)0x4000AFC8))

//*****************************************************************************
//
// SSI registers (SSI3)
//
//*****************************************************************************
#define SSI3_CR0_R              (*((volatile uint32_t *)0x4000B000))
#define SSI3_CR1_R              (*((volatile uint32_t *)0x4000B004))
#define SSI3_DR_R               (*((volatile uint32_t *)0x4000B008))
#define SSI3_SR_R               (*((volatile uint32_t *)0x4000B00C))
#define SSI3_CPSR_R             (*((volatile uint32_t *)0x4000B010))
#define SSI3_IM_R               (*((volatile uint32_t *)0x4000B014))
#define SSI3_RIS_R              (*((volatile uint32_t *)0x4000B018))
#define SSI3_MIS_R              (*((volatile uint32_t *)0x4000B01C))
#define SSI3_ICR_R              (*((volatile uint32_t *)0x4000B020))
#define SSI3_DMACTL_R           (*((volatile uint32_t *)0x4000B024))
#define SSI3_PP_R               (*((volatile uint32_t *)0x4000BFC0))
#define SSI3_CC_R               (*((volatile uint32_t *)0x4000BFC8))

//*****************************************************************************
//
// UART registers (UART0)
//
//*****************************************************************************
#define UART0_DR_R              (*((volatile uint32_t *)0x4000C000))
#define UART0_RSR_R             (*((volatile uint32_t *)0x4000C004))
#define UART0_ECR_R             (*((volatile uint32_t *)0x4000C004))
#define UART0_FR_R              (*((volatile uint32_t *)0x4000C018))
#define UART0_ILPR_R            (*((volatile uint32_t *)0x4000C020))
#define UART0_IBRD_R            (*((volatile uint32_t *)0x4000C024))
#define UART0_FBRD_R            (*((volatile uint32_t *)0x4000C028))
#define UART0_LCRH_R            (*((volatile uint32_t *)0x4000C02C))
#define UART0_CTL_R             (*((volatile uint32_t *)0x4000C030))
#define UART0_IFLS_R            (*((volatile uint32_t *)0x4000C034))
#define UART0_IM_R              (*((volatile uint32_t *)0x4000C038))
#define UART0_RIS_R             (*((volatile uint32_t *)0x4000C03C))
#define UART0_MIS_R             (*((volatile uint32_t *)0x4000C040))
#define UART0_ICR_R             (*((volatile uint32_t *)0x4000C044))
#define UART0_DMACTL_R          (*((volatile uint32_t *)0x4000C048))
#define UART0_9BITADDR_R        (*((volatile uint32_t *)0x4000C0A4))
#define UART0_9BITAMASK_R       (*((volatile uint32_t *)0x4000C0A8))
#define UART0_PP_R              (*((volatile uint32_t *)0x4000CFC0))
#define UART0_CC_R              (*((volatile uint32_t *)0x4000CFC8))

//*****************************************************************************
//
// UART registers (UART1)
//
//*****************************************************************************
#define UART1_DR_R              (*((volatile uint32_t *)0x4000D000))
#define UART1_RSR_R             (*((volatile uint32_t *)0x4000D004))
#define UART1_ECR_R             (*((volatile uint32_t *)0x4000D004))
#define UART1_FR_R              (*((volatile uint32_t *)0x4000D018))
#define UART1_ILPR_R            (*((volatile uint32_t *)0x4000D020))
#define UART1_IBRD_R            (*((volatile uint32_t *)0x4000D024))
#define UART1_FBRD_R            (*((volatile uint32_t *)0x4000D028))
#define UART1_LCRH_R            (*((volatile uint32_t *)0x4000D02C))
#define UART1_CTL_R             (*((volatile uint32_t *)0x4000D030))
#define UART1_IFLS_R            (*((volatile uint32_t *)0x4000D034))
#define UART1_IM_R              (*((volatile uint32_t *)0x4000D038))
#define UART1_RIS_R             (*((volatile uint32_t *)0x4000D03C))
#define UART1_MIS_R             (*((volatile uint32_t *)0x4000D040))
#define UART1_ICR_R             (*((volatile uint32_t *)0x4000D044))
#define UART1_DMACTL_R          (*((volatile uint32_t *)0x4000D048))
#define UART1_9BITADDR_R        (*((volatile uint32_t *)0x4000D0A4))
#define UART1_9BITAMASK_R       (*((volatile uint32_t *)0x4000D0A8))
#define UART1_PP_R              (*((volatile uint32_t *)0x4000DFC0))
#define UART1_CC_R              (*((volatile uint32_t *)0x4000DFC8))

//*****************************************************************************
//
// UART registers (UART2)
//
//*****************************************************************************
#define UART2_DR_R              (*((volatile uint32_t *)0x4000E000))
#define UART2_RSR_R             (*((volatile uint32_t *)0x4000E004))
#define UART2_ECR_R             (*((volatile uint32_t *)0x4000E004))
#define UART2_FR_R              (*((volatile uint32_t *)0x4000E018))
#define UART2_ILPR_R            (*((volatile uint32_t *)0x4000E020))
#define UART2_IBRD_R            (*((volatile uint32_t *)0x4000E024))
#define UART2_FBRD_R            (*((volatile uint32_t *)0x4000E028))
#define UART2_LCRH_R            (*((volatile uint32_t *)0x4000E02C))
#define UART2_CTL_R             (*((volatile uint32_t *)0x4000E030))
#define UART2_IFLS_R            (*((volatile uint32_t *)0x4000E034))
#define UART2_IM_R              (*((volatile uint32_t *)0x4000E038))
#define UART2_RIS_R             (*((volatile uint32_t *)0x4000E03C))
#define UART2_MIS_R             (*((volatile uint32_t *)0x4000E040))
#define UART2_ICR_R             (*((volatile uint32_t *)0x4000E044))
#define UART2_DMACTL_R          (*((volatile uint32_t *)0x4000E048))
#define UART2_9BITADDR_R        (*((volatile uint32_t *)0x4000E0A4))
#define UART2_9BITAMASK_R       (*((volatile uint32_t *)0x4000E0A8))
#define UART2_PP_R              (*((volatile uint32_t *)0x4000EFC0))
#define UART2_CC_R              (*((volatile uint32_t *)0x4000EFC8))

//*****************************************************************************
//
// UART registers (UART3)
//
//*****************************************************************************
#define UART3_DR_R              (*((volatile uint32_t *)0x4000F000))
#define UART3_RSR_R             (*((volatile uint32_t *)0x4000F004))
#define UART3_ECR_R             (*((volatile uint32_t *)0x4000F004))
#define UART3_FR_R              (*((volatile uint32_t *)0x4000F018))
#define UART3_ILPR_R            (*((volatile uint32_t *)0x4000F020))
#define UART3_IBRD_R            (*((volatile uint32_t *)0x4000F024))
#define UART3_FBRD_R            (*((volatile uint32_t *)0x4000F028))
#define UART3_LCRH_R            (*((volatile uint32_t *)0x4000F02C))
#define UART3_CTL_R             (*((volatile uint32_t *)0x4000F030))
#define UART3_IFLS_R            (*((volatile uint32_t *)0x4000F034))
#define UART3_IM_R              (*((volatile uint32_t *)0x4000F038))
#define UART3_RIS_R             (*((volatile uint32_t *)0x4000F03C))
#define UART3_MIS_R             (*((volatile uint32_t *)0x4000F040))
#define UART3_ICR_R             (*((volatile uint32_t *)0x4000F044))
#define UART3_DMACTL_R          (*((volatile uint32_t *)0x4000F048))
#define UART3_9BITADDR_R        (*((volatile uint32_t *)0x4000F0A4))
#define UART3_9BITAMASK_R       (*((volatile uint32_t *)0x4000F0A8))
#define UART3_PP_R              (*((volatile uint32_t *)0x4000FFC0))
#define UART3_CC_R              (*((volatile uint32_t *)0x4000FFC8))

